/*
  Localizable.strings
  Patched Sur

 Portuguese (pt-BR)
  Created by Ben Sova on 4/25/21.
*/

// MARK: Pre-Install App (96)
// Generic

"GET-STARTED" = "Iniciar";
"CONTINUE" = "Continuar";
"GO-BACK" = "Voltar";
"Cancel" = "Cancelar";
"BROWSE" = "Navegar";
"REFRESH" = "Refrescar";
"CONTINUE-ERASE" = "Continuar e Apagar";
"REQUEST-ROOT" = "Solicitar permissões de Root";
"EXTRACT-PACKAGE" = "Extraindo Pacote";
"FINISHED" = "Terminado";

// Enter Password Prompt
"B-ENTER-PASS-CHANGES" = "Patched Sur gostaria de fazer mudanças.";
"B-ENTER-PASS-ALLOW" = "Digite sua senha para permitir isso.";
// The main difference here is
"B-EP-USERNAME" = "Nome do Usuário:";
// The only difference here is the colon, which sounds dumb, but it's needed.
"B-EP-PASSWORD" = "Senha:";
"B-EP-PASSWORD-PH" = "Senha";

// Welcome Page

// Reminder! "Patched Sur" is a formal name, so don't localize that. (Patches/Patcher can be localized, just not Patched Sur)
"PRE-WELCOME-TITLE" = "Bem-vindo ao Patched Sur!";
"PRE-WELCOME-DESCRIPTION" = "Este patcher é feito para lhe proporcionar a atualização mais simples para o MacOS Big Sur em seu Mac não suportado. Prepara tudo para ser perfeito até o final da instalação, e assegura que nada vai dar errado com sua instalação. Ao final, o Patched Sur tentará fazer com que seu Mac funcione como um Mac suportado.";

// Thanks To Page

"THANKS-TITLE" = "Agradecimentos";
"THANKS-CONTENT" = "Patched Sur não é só por mim (Ben), várias outras pessoas têm contribuído para o remendo e os remendos fazendo disto o que é hoje!

- Barrykn: Fez o micropatcher que me introduziu no processo de patching e restaurou minha fé em meu computador realmente antigo. Meu chapéu está fora para Barrykn, e o seu também deveria estar.
- ASentientBot: Fez os patches Hax para o instalador e trouxe o framebuffer GeForce Tesla (9400M/320M) para Big Sur junto com os patches de aceleração de gráficas não-metálicas.
- jackluke: Descobriu como contornar as verificações de compatibilidade no USB do instalador.
- alta voltagem12v: Fez os primeiros kexts WiFi usados com o Big Sur
- ParrotGeek: desenvolveu o LegacyUSBInjector kext para colocar portas USB funcionando em alguns Macs mais antigos e descobrir uma maneira de ignorar os comandos do terminal ao abrir o aplicativo instalador no USB.
- testheit: Ajudado com o comando kmutil no micropatcher (que também é usado no Patched Sur)
- Ausdauersportler: Patches integrados para suporte de Metal GPU para iMac.
- StarPlayrX: Apontado para fora startosinstall que foi posteriormente utilizado no patcher para permitir o suporte de atualização macOS sem um USB.
- ASentientHedgehog: Ajudado de forma aleatória ao longo do caminho.
- Equipe OCLP: Ajudado com material a nível de kernel para placas não-Tesla para aceleração de gráficos não-metálicos.
- dosdude1: OpenGL/GPUSupport swap e, claro, um monte de coisas de patching usadas em seu patcher.
- Bweesh, Bruno Rocha, DutchDK, NickP0is0n, 8itCat, Finder352, DJT_233, Noah Fetz, duke4e, e riiveraluis pela tradução da app.
- John_val, fromeister2009, Mr. Macintosh, Emperor Epitaph, Finder352, Monkiey e 8itCat para testar algumas das novas características antes do lançamento, e apontar os bugs com eles.
- e vários outros que ajudaram a fazer o Big Sur funcionar tão bem quanto em Macs não suportados.

Patched Sur também usa duas estruturas Open Source, Files e ShellOut por JohnSundell (Licença MIT), para ajudar a lidar com certas tarefas";

// Please Remember Page

"PLEASE-REMEMBER" = "Lembre-se";
"PRE-PR-1" = "O Patched Sur está atualmente em beta e nunca será perfeito. Embora não corrompa seu Mac, ele pode fazer com que você perca seus dados se não tiver um backup.";
"PRE-PR-2" = " Não importa o que aconteça, faça um backup da Time Machine antes da atualização. ";
"PRE-PR-3" = "Eu (e os colaboradores) não serei responsável se algo der errado. Farei o melhor que puder para ajudar se houver algum problema, mas não sei tudo e há alguns casos em que não posso ajudar. Muitas vezes, a culpa nem sequer é do Patched Sur, portanto não há nada que eu possa fazer.";

// Mac Compatibility Page

"PRE-VERIFY-MAC" = "Verificando Mac";
"PRE-VERIFY-QUICK" = "Este primeiro passo é essencial para o quão confiável é o Patched Sur. Este passo tenta detectar o maior número possível de problemas causados antes de encontrá-los. Isto inclui FileVault, sem aceleração gráfica e alguns outros problemas. Não se preocupe, isto será rápido.";
"PRE-VERIFY-FETCH" = "Buscando informações";
"PRE-VERIFY-2" = "Verificando Mac";

"PRE-REPORT-BY" = "Reportado por: ";
"PERSON" = "pessoa";
"OTHERS" = "outros";
"APPROVES" = "aprova";
"APPROVE" = "aprovar";

"WiFi, Ethernet and Bluetooth" = "WiFi, Ethernet e Bluetooth";
"I/O Ports" = "I/O Ports";
"Graphics Acceleration" = "Aceleração de Gráficos";
"Sleep and Brightness" = "Sono e Brilho";
"FileVault" = "FileVault";
"Personal Hotspots" = "Hotspots Pessoais";
"Personal Hotspot" = "Hotspot Pessoal";
"WPA2 Enterprise" = "WPA2 Enterprise";

"PROB-FATAL" = "Problema Fatal Detectado";
"PROB-WARN" = "Possível Problema Detectado";
"PROB-NO-UPGRADE" = "Você não pode se atualizar ao Big Sur devido a este ou outros problemas.";
"PROB-CONTINUE-ANYWAY" = "Continuar Enfim";
"PROB-OTHERS" = "Outros Problemas";

"PROB-FILE-TITLE" = "FileVault está Ativo.";
"PROB-FILE-DESCRIPTION" = "Seu Mac tem o FileVault ativado. Embora esta seja uma boa ferramenta de criptografia, ela quebra no Big Sur com Macs não suportados. Você será completamente incapaz de iniciar no modo de recuperação e, às vezes, talvez você não consiga desbloquear seu disco. Você deve desabilitar isto antes de executar o patcher. Você pode fazer isso entrando em Preferências do Sistema, clicando em Segurança e Privacidade, indo até FileVault, e clicando no ícone de cadeado e desativando-o.";

// Reminder! "BigMac" and "StarPlayrX" are a formal names, so don't localize that.
"PROB-PRO-TITLE" = "Há um patcher melhor para Mac Pros";
"PROB-PRO-DESCRIPTION" = "Enquanto o Patched Sur é ótimo para muitos Macs, o Mac Pros realmente não deve ser usado com este patcher. Eles não têm os patches adequados, e há outro patcher fácil de usar, projetado especificamente para Mac Pros. É o BigMac Patcher do StarPlayrX, e ele lhe dará uma experiência incrível para seu Mac.";

"PROB-GX-TITLE" = "Sem Aceleração de Gráficos";
"PROB-GX-DESCRIPTION" = "Seu Mac não suporta aceleração de gráficos Metal, então Big Sur funcionará extremamente lento. Não espere que ele seja rápido e não espere que ele funcione bem. Você não pode consertar isto e um patch está em andamento para consertar isto, mas o seu estado atual é extremamente instável. Se você quiser continuar, você pode, mas não espere uma experiência mágica completa do Big Sur.";

"PROB-SURE" = "Você tem certeza de que quer continuar?";
"PROB-SURE-SURE" = "O Patched Sur detectou problemas que poderiam (e irão) causar problemas com o Big Sur. Seu Mac pode não estar em seu potencial máximo, e em alguns casos pode ser bom apenas dizer em Catalina.";

"REPORT-UNKNOWN" = "Compatibilidade Desconhecida";
"REPORT-UNKNOWN-2" = "Dependendo de seu Mac, o Patched Sur pode ou não funcionar muito bem, e o Patched Sur não encontrou nenhum relatório de compatibilidade para seu Mac, portanto não pode lhe dizer atualmente. Não se preocupe, não há muitas pessoas que tenham dado informações sobre o quão bem o Patched Sur funciona em todos os diferentes Macs, portanto, seu Mac provavelmente funcionará perfeitamente bem. Uma vez atualizado, você pode contribuir com suas experiências (vá para Configurações no aplicativo pós-instalação), e ajudar futuras pessoas com seu Mac!";

// Update Track Page

"PRE-TRACK-TITLE" = "Definir caminho de atualização";
"PRE-TRACK-DESCRIPTION" = "Seu caminho de atualização define o que as versões do macOS recebem. A faixa de lançamento é a mais estável, e provavelmente o que você já está usando. Beta lhe dá acesso às novas características do macOS mais cedo, mas às vezes é instável.";

"TRACK-RELEASE" = "Lançamento";
"TRACK-BETA" = "Beta";

// macOS Select Page

"PRE-VERS-TITLE" = "macOS Versão Big Sur";
"PRE-VERS-DESCRIPTION" = "Enquanto na maioria dos casos você vai querer a última versão do MacOS Big Sur, você pode, por qualquer razão, querer uma versão mais antiga, e você pode configurar isso aqui. Se você quiser usar um aplicativo InstallAssistant.pkg ou installer pré-descarregado, você pode clicar em navegar. Se você quiser apenas baixar e usar a versão mais recente do macOS, basta clicar em Download.";
"PRE-VERS-NOFI" = "A lista de instaladores macOS disponíveis não pôde ser acessada. Isto provavelmente se deve ao fato de que o WiFi não está disponível. Você deve usar um instalador de macOS pré-descarregado.";
// NOTE: In these two, XX.YY.ZZ is the macOS version. So in English, the first would show Download macOS 11.3. \(installers[0].version)
"PRE-VERS-DOWNLOAD" = "Descarregar macOS XX.YY.ZZ";
"PRE-VERS-USE" = "Use macOS XX.YY.ZZ";
"PRE-VERS-PRE" = "Use macOS Pre-Descarregado";
"PRE-VERS-REDOWNLOAD" = "Descarregar de novo";
"PRE-VERS-FETCH" = "Buscando o instaladores";

// Downloading Kexts Page

"DOWNLOAD-PATCHES" = "Descarregando Patches";
"DOWNLOAD-FILES" = "Descarregando Arquivos";
"PRE-DP-1" = "A ferramenta set vars permite que você configure corretamente o status NVRAM e SIP, de modo que o Big Sur permite que você inicialize nele.";
"PRE-DP-2" = "Esta é a última ferramenta que você usará antes de instalar o Big Sur.";
"PRE-DP-3" = "Você só precisará disto se não o tiver executado antes naquele Mac ou se tiver feito um reset da PRAM.";
"PRE-DP-4" = "Os patches kext permitem que você use hardware como WiFi e portas USB, para que seu Mac permaneça em sua plena funcionalidade.";
"PRE-DP-CANCEL-1" = "Os patches que serão usados mais tarde pelo o patcher estão sendo descarregados atualmente. Você tem certeza de que quer voltar?";
"PRE-DP-CANCEL-2" = "Os Patches Estão Descarregando";
"CANCEL-DOWNLOAD" = "Cancelar a Descarga";
"RESTART-DOWNLOAD" = "Reiniciar a Descarga";
"CONTINUE-DOWNLOAD" = "Continuar a Descarga";
"PRE-DP-CANCEL-3" = "Os patches falharam em descarregar, mas isto poderia ser resolvido tentando novamente. Você gostaria de tentar descarregar os adesivos novamente ou ir para o passo anterior?";
"PRE-DP-CANCEL-4" = "Você gostaria de reiniciar a descarga??";

// Downloading macOS Page

"PRE-DM-TITLE" = "Descarregando macOS";
"PRE-DM-DESCRIPTION" = "Atualmente, o macOS está sendo descarregado diretamente da Apple para que possa ser colocado no USB instalador. Este é um instalador completo, portanto, é um download de 12 GB. Vai demorar um pouco, então deixe ir e certifique-se de que sua conexão de internet esteja boa. Após isto ser feito, você terá que selecionar um drive USB para usar no instalador e então o Patched Sur usará este arquivo para tornar o instalador USB.";
"PRE-DM-BAR" = "Descarregando macOS XX.YY.ZZ";
"PRE-DM-CANCEL-1" = "O MacOS Big Sur está sendo descarregado atualmente para que possa ser usado mais tarde. Este é um grande download. Você tem certeza de que quer voltar?";
"PRE-DM-CANCEL-2" = "macOS está Descarregando";
"PRE-DM-CANCEL-3" = "macOS não conseguiu fazer o descarregamento, mas isso poderia ser resolvido tentando novamente. Você gostaria de tentar descarregar macOS novamente ou ir para o passo anterior?";

// Select Volume Page

"PRE-VOL-TITLE" = "Selecionar um Volume USB";
"PRE-VOL-1" = "Para instalar o Patched Big Sur inicialmente, você precisa de uma instalação USB que ajudará com a atualização. Isto proporciona um ambiente onde o patcher pode ter certeza de que tudo irá funcionar corretamente.";
"PRE-VOL-2" = "Para criar um instalador, você precisa de um volume para colocar o instalador.";
"PRE-VOL-3" = "Este USB precisa ser de 16GB ou maior. As partições internas não funcionarão, mas as externas dependem do mapa de partição (que provavelmente estará correto com o Mapa de Partição GUID). Se sua unidade não aparecer, certifique-se de que esteja formatada como MacOS Extended (Journaled).";
"PRE-VOL-NO" = "Não foram detectados unidades compatíveis.";
// Note: VOLUME is the volume name, do not localize it, just pretend it's a volume name and just place it into your sentence
// Ex. If the volume was "SuperDrive", then "VOLUME will be erased." would show up as "SuperDrive will be erased."
"PRE-VOL-ERASED" = "VOLUME será apagado.";
"PRE-VOL-ERASED-2" = "Todos os arquivos deste volume serão completamente apagados. Isto não pode ser desfeito. Você tem certeza de que gostaria de continuar?";
"PRE-VOL-DETECTING" = "Detectando Volumes";
"PRE-VOL-CHECKING" = "Verificando VOLUME";

// Create Installer Page

"PRE-CTI-TITLE" = "Criando um instalador USB";
"PRE-CTI-DESCRIPTION" = "Agora o USB que você selecionou está sendo usado para criar um instalador USB macOS. Os arquivos copiados no disco criam um ambiente similar ao MacOS Big Sur Modo de Recuperação. Uma vez que esses arquivos são colocados no USB, o Patched Sur entra em cena e faz o patch permitindo que seu Mac inicie nele e dando-lhe algumas ferramentas úteis para um patched Mac.";
"PRE-CTI-CANCEL-1" = "Você tem certeza de que quer cancelar a fabricação do instalador de patched macOS? Você precisará disto para atualizar para macOS Big Sur, e muitas vezes leva muito tempo para ser feito.";
"PRE-CTI-CANCEL-2" = "Um instalador de macOS está Sendo Feito";
"CANCEL-PROCESS" = "Cancelar o Processo";
"RESTART-PROCESS" = "Reiniciar o Processo";
"CONTINUE-PROCESS" = "Continuar o Processo";
"PRE-CTI-CANCEL-3" = "Houve um erro durante a criação do USB instalador do MacOS, no entanto você pode querer tentar novamente para possivelmente corrigir este erro.";
"PRE-CTI-CANCEL-4" = "Gostaria de tentar novamente?";
"PRE-CTI-CREATING" = "Criando o Instalador";

// Done Page
"PRE-DONE-INFO" = "Você está quase lá no seu caminho de atualização para o Big Sur. O instalador USB foi criado com sucesso e está na hora de um pequeno trabalho manual da sua parte. Se você não estiver seguindo diretamente um tutorial, escreva estes passos para que você saiba fazê-los (estes são passos realmente fáceis, mesmo que pareça muitos deles):

1. Reinicie sua Mac mantendo pressionada a tecla opção até ver alguma unidade aparecer na tela.
2. Selecione a bota EFI amarela ou roxa. Isto desligará imediatamente seu computador.
3. Volte a ligar o Mac, de novo mantendo pressionada a tecla opção,
4. Selecione Instalar macOS Big Sur.
5. Assim que o Mac iniciar, selecione de novo (Re)Instalar o macOS Big Sur. (Pode parecer, mas isso não vai apagar os dados do utilizador, apenas vai atualizar os arquivos do sistema como uma atualização normal).
6. Quando esse app abrir, passe pelo app e selecione seu volume principal (provavelmente Macintosh HD, e NÃO Instale MacOS Big Sur)
7. Após a atualização estar completa e você ver a janela de login, abra sua pasta de Aplicações e inicie o Patched Sur.
8. Clique em Patch Kexts, depois pressione Continuar e digite sua senha.
9. Depois disso, reinicie seu Mac e aproveite o Big Sur!";
// I suggest adding "However, these are only in English." to the end of this, since the linked page is only in English.
"PRE-DONE-LINK" = "Você também pode encontrar estas etapas no GitHub.\nNo entanto, estas estão apenas em inglês.";
"PRE-DONE-STEPS" = "(Passos 10-14)";

// MARK: Post-Install App (96)

// General

"BACK" = "Voltar";
"RESTART-TO-FINISH" = "Reiniciar para Terminar";

// MARK: Menu Bar

"PO-MN-ABOUT-PATCHER" = "Sobre Patched Sur";
"PREFERENCES" = "Preferências";
"PO-AMM-TITLE" = "Sobre Meu Mac";
"PO-MN-HELP" = "Patched Sur Ajuda";
"PO-MN-HELP-OS" = "Atualizando macOS";
"PO-MN-HELP-PATCHER" = "Atualização do patcher";

// MARK: Update Notifications

// VERSIONTAG is the version number of the new patcher/macOS version (like 0.3.1 or 11.3.1).
"PO-NOFI-SELF" = "O Patched Sur pode agora ser atualizado para a Versão VERSIONTAG. Abra o Patched Sur e clique em Executar Atualizações para saber mais.";
"PO-NOFI-OS-TITLE" = "Atualização de software";
"PO-NOFI-OS-DESCRIPTION" = "macOS Big Sur VERSIONTAG pode agora ser instalado em seu aparelho. Abra o Patched Sur e clique em Atualizar macOS para saber mais.";

// MARK: About Patched Sur

// APPBUILD is the app's version build number, like "96".
"PO-ATP-AUTHOR-BUILD" = "Por: Ben Sova - Build APPBUILD";
"PO-ATP-DESCRIPTION" = "Um patcher fácil, com um grande núcleo, para facilitar a execução do Big Sur em um mac sem suporte, desenvolvido para qualquer pessoa.";
"PO-ATP-WHATS-NEW-QUESTION" = "O que há de novo na v1.0.0?";
"PO-ATP-WHATS-NEW-ANSWER" = "Vai ser rápido, poderoso e claro para todos, mesmo que você não seja metal ou não seja inglês.";

// MARK: Central View

"PO-UP-TITLE" = "Executar Atualizações";
"PO-UP-DESCRIPTION" = "Atualize o macOS ou o patcher para uma versão mais recente para se manter atualizado.";
"PO-PK-TITLE" = "Patch Kexts";
"PO-PK-DESCRIPTION" = "A Kexts fornece ao MacOS a sua plena funcionalidade, para que tudo funcione como deveria.";
"PO-ST-TITLE" = "Configurações";
"PO-ST-DESCRIPTION" = "Desativar as animações, permitir a troca de gráficos, mostrar logs e talvez mais.";
"PO-CI-TITLE" = "Criar Instalador";
"PO-CI-DESCRIPTION" = "Faça uma unidade USB do instalador Big Sur que pode (re)instalar o MacOS e muito mais.";
"PO-IR-TITLE" = "Instalar o Modo de Recuperação";
"PO-IR-DESCRIPTION" = "Patch do volume de recuperação atual (usado com CMD-R na inicialização). Nem sempre útil.";
"PO-AMM-DESCRIPTION" = "Mostre informações sobre seu mac sem o número de série. Bom para mostrar o seu sucesso.";

"PO-PK-NO-NEED-TITLE" = "Patch Kexts Desnecessário";
"PO-PK-NO-NEED-DESCRIPTION" = "Você não precisa remendar os kexts em iMacs de final de 2013. A Big Sur já está funcionando em plena funcionalidade.";

// MARK: Settings View

"PO-ST-TITLE-ALT" = "Configurações Extras";
"PO-ST-SUBTITLE" = "Algumas ferramentas/patches úteis";
"PO-ST-SECTION-1" = "Patches extras";
"PO-ST-SECTION-2" = "Ferramentas extras";
"PO-ST-RESTART-APPLY" = "Assim que você reiniciar seu Mac, as mudanças serão aplicadas.";

"PO-ST-DA-DISABLE" = "Desativar Animações";
"ENABLE" = "Ativar";
"PO-ST-DA-DISABLE-DONE" = "Animações Desativadas!";
"PO-ST-DA-DISABLE-DONE-2" = "Assim que você reiniciar seu Mac, as mudanças serão aplicadas, e o Big Sur deverá se apresentar um pouco melhor.";
"PO-ST-DA-ENABLE-DONE" = "Animações Ativadas!";
"PO-ST-DA-DESCRIPTION" = "A desativação das animações pode ajudar os macs sem Metal. Como eles não têm aceleração gráfica, o Big Sur funciona extremamente lento, portanto, desativar as animações ajudará um pouco.";

"PO-ST-GXS-ENABLE" = "Ativar a Troca de Gráficos";
"DISABLE" = "Desativar";
"PO-ST-GXS-DESCRIPTION" = "Se você tem um mac com muitas GPUs, então você provavelmente quer a troca automática de gráficos ativada para troca de gráficos. Graças a @15wat por ter encontrado esta solução.";
"PO-ST-GXS-ENABLE-DONE" = "Troca de Gráficos Ativada";
"PO-ST-GXS-ENABLE-DONE-2" = "Agora os gráficos irão trocar automaticamente! Um reinício pode ser necessário para que as mudanças entrem em vigor.";
"PO-ST-GXS-ENABLE-FAILED" = "Falha em ativar a Troca de Gráficos";
"PO-ST-GXS-DISABLE-DONE" = "Troca de Gráficos Desativada";
"PO-ST-GXS-DISABLE-DONE-2" = "Agora os gráficos não vão mais trocar automaticamente! Um reinício pode ser necessário para que as mudanças entrem em vigor.";
"PO-ST-GXS-ENABLE-FAILED" = "Falha em Desativar a Troca de Gráficos";

"PO-ST-PKL-BUTTON" = "Mostrar Logs de Patch Kexts";
"PO-ST-PKL-DESCRIPTION" = "Se você estiver tendo problemas com o Patch Kexts não funcionando, talvez valha a pena ver os logs e procurar por erros. Isto pode ajudar alguém tentando ajudá-lo a descobrir o problema, portanto, se você puder, forneça isto a qualquer um que tente ajudá-lo.";
"PO-ST-PKL-TITLE" = "Patch Kexts Logs";
"PO-ST-PKL-NO-LOGS" = "Não foram capturados logs";
"PO-ST-PKL-COPIED" = "Copiado!";
"PO-ST-PKL-COPIED-2" = "Os últimos logs do Patch Kexts foram copiados para sua prancheta. Isto pode ajudar na depuração, e certifique-se de compartilhar isto com qualquer pessoa que tente ajudá-lo com seu problema.";

"PO-ST-CL-TITLE" = "Limpar as sobras de Patched Sur";
"PO-ST-CL-DESCRIPTION" = "Às vezes, o Patched Sur deixa acidentalmente pequenas sobras de quando algo corria. Isto às vezes poderia economizar 12GB de espaço de armazenamento, isto é sugerido especialmente depois que você corre o atualizador.";
"PO-ST-CL-DONE" = "Sobras foram limpas";
"PO-ST-CL-DONE-2" = "Os arquivos foram excluídos, você deve ver mais algum espaço livre (supondo que realmente houvesse arquivos grandes para serem limpos).";

"PO-ST-CYE-TITLE" = "Contribua com suas experiências";
// Add a translation for 'Please Note: These reports are only accepted in English.' to this next value
"PO-ST-CYE-DESCRIPTION" = "O aplicativo de pré-instalação no Patched Sur tem uma característica que permite aos novos usuários saber o quão bem seu mac irá funcionar com o Big Sur. Entretanto, algo assim precisa de informações, e é com isso que você pode ajudar! Basta clicar no link acima e seguir as instruções para ajudar. Nota: Estes relatórios só são aceitos em inglês.";

"PO-ST-RL-TITLE" = "Relançar o Patcher";
"PO-ST-RL-DESCRIPTION" = "Eu não sei por que você quereria isto, mas acho que se você quiser, você pode relançar o aplicativo patcher. Isto irá refrescar muitas das variáveis que são obtidas quando o patcher é lançado pela primeira vez, e o que não for. Fato engraçado: Este é o mesmo código que é executado uma vez que o atualizador é feito.";
"PO-ST-RL-FAILED" = "Relançamento Falhado!";
"PO-ST-RL-FAILED-2" = "Falhou em abrir o Patched Sur, mas você mesmo pode fazer isso.";

// MARK: Patch Kexts Page

"PO-PK-TITLE-ALT" = "Unpatch Kexts";
"PO-PK-SUBTITLE" = "Basicamente fazer os Drivers Funcionarem";
"PO-PK-DESCRIPTION-2" = "Fazer o Patch dos kexts faz com que o Wifi, USB e várias outras coisas funcionem na instalação do Big Sur. Sem estes kexts o Big Sur não vai estar no seu pleno potencial e varias coisas não vão funcionar. Se for necessário podes fazer Un-Patch dos kexts e, depois, voltar a fazer o Patch, o que pode resolver algum problema. Às vezes, pode ser uma boa ideia esperar um pouco antes de executar o patch dos kexts, já que algumas coisas podem estar a interferir no volume do sistema.";
"PO-PK-START" = "Iniciar o Patch Kexts";
"PO-PK-UN-START" = "Iniciar o Un-Patch Kexts";
"PO-PK-INSTEAD" = "Un-Patch Kexts ao invés";
"PO-PK-INSTEAD-REVERSE" = "Patch Kexts ao invés";
"PO-PK-DETECT" = "Detectando Patches";
"PO-PK-NONE-DETECTED" = "Recursos de Patch não foram detectados";
"PO-PK-NONE-HELP" = "Tente conectar um instalador USB com Patched Instalador";
"PO-PK-RUNNING" = "Patchando Kexts";
"PO-PK-UN-RUNNING" = "Un-Patchando Kexts";
"PO-PK-LEGACY-ALERT" = "Os Únicos Patches Detectados Exigem o Modo Legado";

// MARK: Create Installer Others

"PO-CI-START-TITLE" = "Criar o Instalador macOS";
"PO-CI-START-DESCRIPTION" = "Esta ferramenta permite que você crie um instalador USB com patches para o MacOS Big Sur, semelhante à forma como o aplicativo de pré-instalação o faz, exceto com algumas alterações. Isto pode definitivamente ser usado como um 'só no caso' se você se deparar com um problema mais tarde com o remendador. Note que você pode instalar uma partição de recuperação que é bastante similar a esta, porém atualmente ela não pode reinstalar o macOS, já que não há WiFi na recuperação, mas esta pode. Observe também que se você estiver usando isto para atualizar, há uma maneira mais fácil, que é o aplicativo pós-instalação.";
"PO-CI-FINISHED-TITLE" = "Concluído Criação de um Instalador macOS";
"PO-CI-FINSIHED-DESCRIPTION" = "Este instalador pode agora ser utilizado para o que você quiser. Ele é totalmente remendado exatamente como seria se você o fizesse com o aplicativo de pré-instalação. Ele contém o instalador macOS (espero que você saiba disso), um ambiente em modo de recuperação total e, é claro, o Patched Sur para patchando os kexts.";

// MARK: About This Mac

"PO-AMM-MODEL" = "Modelo";
"PO-AMM-PROCESSOR" = "Processador";
"PO-AMM-GRAPHICS" = "Gráficos";
"PO-AMM-MEMORY" = "Memória";
"PO-AMM-BACK" = "Voltar ao início";
"PO-AMM-UPDATE" = "Atualização de Software";
"PO-AMM-VERSION" = "Versão";

// MARK: Update Status

"PO-UP-CHECKING" = "Verificação de Atualizações";
"PO-UP-CHECK-FAILED" = "Falha na Verificação de Atualizações";
"PO-UP-CHECK-FAILED-1" = "Isto provavelmente significa que ou sua conexão WiFi está em baixo, ou os servidores de hospedagem da Web do GitHub estão em baixo. Isto não deve ser um grande problema, supondo que você possa atualizar o macOS manualmente com o aplicativo pré-instalado, ou atualizar o próprio aplicativo patcher baixando-o da página Patched Sur GitHub.";
"PO-UP-TITLE-PATCHER" = "Atualizar o Patcher";
"PO-UP-TITLE-MACOS" = "Atualizar o macOS";

"PO-UP-USING-TRACK" = "Você está usando o";
// Imagine that this is like a sentence. First you see the above phrase, then Release or Beta, then the next text.
// So this would read, "You are using the Release update track"
"PO-UP-USING-TRACK-2" = "caminho de atualização.";
"PO-UP-BETA-DESCRIPTION" = "Estas atualizações podem ser instáveis e nem sempre são sugeridas para uso diário.";
"PO-UP-RELEASE-DESCRIPTION" = "Estas atualizações são normalmente mais estáveis e são a faixa de caminho de atualização.";
"PO-UP-IS-AVALIBLE" = "Uma atualização está disponível!";
"RELEASED" = "Lançado";
"BUILD" = "Construção";
"PO-UP-VIEW-OTHER" = "Ver Outras Versões";
"PO-UP-START-TITLE" = "Iniciar o MacOS Atualização";
"PO-UP-START-DESCRIPTION" = "Para atualizar, o patcher primeiro baixará os últimos patches e depois a nova versão do macOS diretamente da Apple, e depois disso o atualizador da Apple será iniciado sem a verificação de compatibilidade.";
"PO-UP-NOTES-TITLE" = "Veja as Notas de Lançamento mais recentes";
"PO-UP-NOTES-DESCRIPTION" = "Veja o que há de novo em macOS antes de atualizar. Obrigado ao Sr. Macintosh (ou Apple/9to5Mac às vezes) por fornecê-los.";
"PO-UP-NO-UPDATES" = "Não há novas atualizações disponíveis.";
"PO-UP-YOU-ON" = "Você está atualmente na XX.YY.ZZ.";
"PO-UP-NOTIF-TITLE" = "Configurar Notificações de Atualização";
"PO-UP-NOTIF-DESCRIPTION" = "Receba notificações para atualizações tanto para MacOS como para o patcher.";

"PO-UP-NOTIF-TITLE-2" = "Noficações de Atualização";
// In case you don't know, /n means line down. So if I wrote Hello\nWorld, it would show up as:
// Hello
// World
"PO-UP-NOTIF-DESCRIPTION-2" = "Como seu mac não tem suporte, o Software Update nunca o informará sobre as atualizações do macOS, pois ele não tem nada de novo que suporte seu mac. No entanto, o Patched Sur pode fornecer esta funcionalidade por conta própria, prevendo também notificações de atualizações para o patcher, se você desejar.:\n\nReceber notificações para:";
"NO" = "Não";
"YES" = "Sim";
"CONFIRM" = "Confirmar";
"PO-NOTIF-SETUP-DONE" = "Configurar Notificações!";
"PO-NOTIF-SETUP-DONE-2" = "A Patched Sur irá notificá-lo corretamente sobre as atualizações com base em suas novas preferências.";
"PO-NOTIF-SETUP-PERMS" = "O Patched Sur precisa de permissões para enviar notificações.";
"PO-NOTIF-SETUP-PERMS-2" = "Antes que o remetente possa enviar notificações para atualizações disponíveis, o remetente precisa de permissão para enviar as notificações.";
"PO-NOTIF-SETUP-ALMOST" = "Quase lá!";
"PO-NOTIF-SETUP-ALMOST-2" = "Para concluir a configuração das notificações, o Patched Sur requer a confecção de um daemon de usuário que verificará de vez em quando. Para configurar isso, o patcher precisa ter acesso root, então você será solicitado a inserir sua senha, então você estará pronto!";
"PO-NOTIF-SETUP-DENY" = "Patched Sur Não Pode Enviar Notificações";
"PO-NOTIF-SETUP-DENY-2" = "Você deve ter negado ao Patched Sur o envio de notificações. Se você quiser que o Patched Sur envie notificações, abra Preferências do Sistema > Notificações > Patched Sur então permita notificações.";
"PO-NOTIF-SETUP-FAILED" = "Falha na Configuração do Daemon";

"PO-UP-COMPAT-FAIL-SIP" = "Falha em verificar o Status de SIP";
"PO-UP-COMPAT-FAIL-SIP-2" = "O Patched Sur falhou em verificar seu status de SIP, o que deveria ser impossível.";
"PO-UP-COMPAT-SIP-ON" = "O SIP Parece estar Ligado";
"PO-UP-COMPAT-SIP-ON-2" = "Como o instalador verifica se a atualização suporta seu mac, o Patched Sur precisa injetar um dylib nele para que o instalador não se importe com a incompatibilidade. Entretanto, isto só pode ser feito com o SIP desligado, portanto o Patched Sur precisa que você desabilite o SIP antes de continuar. Para desabilitá-lo:

1. Arranca em modo de recuperação (⌘R no arranque)
2. Abre o Terminal em Utilitários.
3. Digita: csrutil disable e pressione enter.
4. Pressione Enter e reinicia o computador, depois tenta executar o Patched Sur novamente.";
"PO-UP-COMPAT-LV-ON" = "A Validação da Biblioteca é Ativada";
"PO-UP-COMPAT-LV-ON-2" = "A Validação da Biblioteca impede que o Patched Sur injete código no instalador do macOS e pule a verificação de compatibilidade. Se você quiser atualizar o macOS, é necessário primeiro desativar a Validação da Biblioteca.";

"SKIP" = "Pular";
"PO-UP-APP-FAILED" = "A Descarga Falhou";
"PO-UP-APP-START" = "Descarga Atualização";
"DOWNLOADING" = "Descarregando";

// MARK: Update Chooser

"PO-UP-CHOOSE-TITLE" = "Escolher Atualização";
"PO-UP-CHOOSE-FAILED" = "Ocorreu um erro enquanto buscava atualizações disponíveis.";
"PO-UP-CHOOSE-PRE" = "Esta versão do macOS já está disponível para download:";
"PO-UP-CHOOSE-CAN" = "Você pode descarregar estas versões de macOS:";
"PO-UP-CHOOSE-DELETE" = "Você tem certeza de que deseja excluir o instalador pré-descarregado?";
"PO-UP-CHOOSE-DELETE-2" = "Embora isto lhe poupe um bom armazenamento de 12,2 GB, também é útil para reinstalar rapidamente o macOS ou realmente qualquer outro motivo pelo qual você possa precisar de um instalador de 12 GB de macOS.";
"DELETE" = "Excluir";
"UPDATE" = "Atualizar";
"REINSTALL" = "Reinstalar";
"UNEXPECTED-ERROR" = "Ocorreu Um Erro Inesperado";
"PO-UP-CHOOSE-EXACT-PATH" = "Este arquivo parece estar faltando e o patch completo não pode ser determinado. Você não pode usar o instalador pré-descarregado por enquanto.";
"PO-UP-CHOOSE-DOWNLOAD" = "Descarregar o instalador macOS";
"PO-UP-CHOOSE-DOWNLOAD-1" = "Você pode atualizar para esta versão do macOS, porém também pode descarregá-la e este é o botão que você clicou. Este popup só existe para garantir que você saiba disso. (Isto só abrirá seu navegador e fará o descarregamento do instalador, nada especial).";
"PO-UP-CHOOSE-DOWNLOAD-2" = "Você não pode \”atualizar\" para uma versão mais antiga do macOS, no entanto, você pode descarregar o instalador se você tiver algo que queira fazer com ele. (Isto só abrirá seu navegador e descarregará, nada especial).";
"PO-UP-CHOOSE-DOWNLOAD-TIP" = "Você também pode descarregar o InstallAssistant.pkg, se desejar.";
"PO-UP-CHOOSE-DOWNLOAD-TIP-2" = "Você não pode atualizar para uma versão antiga do macOS, mas você pode descarregar este instalador se quiser.";
"DOWNLOAD" = "Descarregar";

// MARK: Download Patches/macOS

"DOWNLOAD-PATCH-MACOS" = "Descarregando Patches e macOS";
"DOWNLOADED-PATCHES" = "Patches Descarregados";
"PO-UP-DPM-DESCRIPTION" = "Os patches permitem que você use hardware como WiFi e permite que o patcher sobreponha o código do instalador, de modo que seu mac permaneça em sua plena funcionalidade. macOS está sendo descarregado diretamente da Apple, na forma de um arquivo InstallAssistant.pkg. Com isso, podemos extrair o aplicativo Instalador e então iniciar uma instalação do MacOS. (Às vezes a barra de progresso quebra, mas não importa o que esteja descarregando).";
"DOWNLOADING-MACOS" = "Descarregando macOS";

// MARK: Starting OS Installer

"PO-UP-SOI-TITLE" = "Pronto para Atualizar!";
"PO-UP-SOI-DESCRIPTION" = "Agora, o Patched Sur terminará os preparativos para a atualização e reiniciará no macOS Atualizador. Depois de um tempo, o macOS estará pronto para ser instalado e você poderá remendar os kexts e então desfrutar do macOS. Isto vai demorar um pouco! Assim como a preparação para a parte de atualização das preferências do sistema, esta não é a coisa mais rápida do mundo.";
"PO-UP-SOI-PREPARING" = "Preparando para Atualização";

// MARK: Recovery Patch

"PO-IR-SUBTITLE" = "Um Pouco Útil";
"DISCLAMIER" = "AVISO LEGAL";
"PO-IR-DISCLAIM" = "Isto NÃO É algo em que se deva confiar a 100%. Isso é principalmente apenas um \ “pega, é o melhor vais ter por agora. \" Eu tentei fazer um modo de recuperação de sonho, mas não funcionou, principalmente porque o firmware no teu Mac ignora ficheiros sem razão alguma. Se esses ficheiros não fossem ignorados, eu não teria que escrever esta mensagem. No entanto, podes fazer o seguinte com a recuperação: Gerir valores de NVRAM (como o estado do SIP e os argumentos de arranque), usar o Utilitário de disco, navegar na web (eu acho?) E fazer o unpatch/patch dos kexts (e provavelmente mais algumas coisas).
Minha sugestão é fazer um instalador usb e guarda-lo.
Você não pode reinstalar o macOS com ele.";
"PO-IR-SIP-ON" = "SIP está Ligado";
"PO-IR-SIP-ON-DESCRIPTION" = "O patch de recuperação não pode ser instalado com SIP ligado por causa das proteções do sistema de arquivos. Agora pode parecer que a única maneira de desligar o SIP é com o modo de recuperação, mas existem outras maneiras.\n Se você ainda tiver o instalador USB, você pode ser capaz de inicializar na inicialização do EFI. Se isso não funcionar ou se você não puder fazer isso, inicialize no modo de recuperação pela internet (CMD-OPTION-R no início) e você pode fazer isso a partir daí.";
"PO-IR-PATCHING" = "Patchando da Recuperação";
"PO-IR-PATCHING-DESCRIPTION" = "O modo de recuperação do macOS está agora a ser corrigido no teu Mac. Este processo tem duas etapas: a primeira é fazer a descarga dos ficheiros necessários e a segunda é instalá-los. É super simples e não demora muito. Feito isso, a recuperação do macOS será desbloqueada. Nota que se tiveres várias partições, a recuperação do disco de arranque será (provavelmente) preferida e será feito por aí o arranque em vez de uma das outras recuperações instaladas.";
"PO-IR-DOWNLOAD-RECOVERY" = "Descarregando Recuperação";
"PO-IR-DONE" = "Patch da Recuperação Terminado!";
"GO-HOME" = "Voltar ao Inicio";

// MARK: Three v1.0.0 (102)

// Friends in Settings
// Yes I'm adding this lol - duke4e advertised Patched Sur so I have to get him back and then I decided to add macOSicons.com because I like them. Maybe I'll have more friends later.
"PO-ST-FRIENDS" = "Amigos do Patched Sur";
"PO-ST-FRIENDS-WIDGY" = "Widgy é um aplicativo incrível para fazer widgets 100% personalizados tanto para iOS como para macOS! Com ele você pode cobrir seu iDevice com todos os dados que você deseja, arranjou como você quer, enquanto combina lindamente com o resto de sua tela inicial / desktop. Muito bom, certo?";
"PO-ST-FRIENDS-ICONS" = "macOSicons.com é um site com mais de 5.000 ícones alternativos para o MacOS Big Sur. Você pode obter ícones daqui para substituir ícones de estilo não-Big Sur ou apenas porque você gosta mais dos designs de lá do que o desenvolvedor do design do aplicativo.";

// MARK: Patch Kexts Configuration

"PO-PK-CONFIGURE" = "Configuração Avançada";
"PO-PK-CONFIG-WARN" = "AVISO: Configurações avançadas só devem ser usadas se você souber o que está fazendo!
Certifique-se de não ativar remendos de que você não precisa.";
// This will come right before a button that toggles between "Patch Kexts" and "Unpatch Kexts"
"PO-PK-CONFIG-MODE" = "Modo:";
"PO-PK-CONFIG-UNPATCH" = "Todos os patches kext serão desinstalados e o sistema será restaurado ao seu antigo estado não corrigido. O WiFi não funcionará e possivelmente outras coisas, isto não pode ser configurado. Isto poderia quebrar a coleção de kernel do sistema, resultando ou em um Mac em pânico ou na incapacidade de repatch dos kexts, então é geralmente mais seguro reinstalar o MacOS em vez de descompactar.";
"ENABLED" = "Activado";
"DISABLED" = "Desativado";

// MARK: Boot.plist Settings

"PO-ST-BOOT" = "Patch Boot.plist";
"PO-ST-BOOT-DONE" = "Já Patched Boot.plist";
"PO-ST-BOOT-DESCRIPTION" = "A combinação do com.apple.Boot.plist permite que você faça reinicializações da NVRAM em seu Mac sem precisar do instalador USB e do EFI Boot. Depois disso, você terá que restaurar a NVRAM (Patched Sur ajudará), pois é melhor para você ter esse valor do que não tê-lo. Você terá que reembalar este plist toda vez que atualizar o MacOS.";
"PO-ST-BOOT-ONGOING" = "Patchando Boot.plist";
"PO-ST-BOOT-NONE" = "Não foram detectados patches compatíveis.
Você pode não ter a última versão dos patches baixada, que são necessários para corrigir o boot.plist.
Use o 'Atualizar backup de patches' para atualizar os patches, e depois tente novamente.";

// MARK: Volume Selection

"PRE-VOL-INCOMPAT" = "Ver Drives Incompatíveis";
"PRE-VOL-INCOMPAT-TITLE" = "rives Incompatíveis";
"PRE-VOL-INCOMPAT-NODATA" = "Não é possível encontrar informações em disco, isto pode ser um erro de patcher.";
"PRE-VOL-INCOMPAT-INTERNAL" = "Disco interno, use ao invés disso um USB externo.";
"PRE-VOL-INCOMPAT-IMAGE" = "Imagens em disco não podem ser inicializadas, use um USB externo.";
// For these next two, I suggest checking Disk Utility for the proper terms for GUID Partition Map and MacOS Extended (Journaled).
"PRE-VOL-INCOMPAT-GUID" = "Não está formatado com Mapa de Partição GUID";
"PRE-VOL-INCOMPAT-SYNTH" = "Apple File System (APFS), usa MacOS Expandido (Journaling)";

// MARK: NVRAM Reset Wanring

"PO-NV-POPUP-TITLE" = "Valor Necessário NVRAM Falta";
"PO-NV-POPUP-DESCRIPTION" = "Falta o valor -no_compat_check boot-arg. Embora o Patched Sur já tenha protegido você do maior problema causado por isto, ainda há outros problemas que podem resultar disto.";
"PO-NV-POPUP-START" = "Ver instruções";
"PO-NV-POPUP-DESCRIPTION-TWO" = "Lançar Patched Sur (o aplicativo pós-instalação, não o da dmg) para aprender mais e soluções para restaurar o valor.";
"PO-NV-POPUP-DESCRIPTION-THREE" = "Pressiona Ver Instruções abaixo para aprender como restaurá-la.";

"PO-NV-CHECK-TITLE" = "Você tem seu instalador Patched USB Instalador?";
"PO-NV-CHECK-DESCRIPTION" = "Se você ainda tiver seu Patched USB Installador, então podemos pular muita complexidade e tornar isto super fácil. É altamente recomendável segurar sempre um instalador USB da última versão do MacOS, então se você quiser fazer um agora, clique no botão voltar no canto superior direito da tela, depois clique em Create Installer e siga as instruções para criar um e volte aqui.";
"PO-NV-CHECK-ONE" = "Eu tenho um Patched USB Instalador.";
"PO-NV-CHECK-TWO" = "Eu não tenho.";

"PO-NV-ONE-TITLE" = "Restaurar valor (com instalador)";
"PO-NV-ONE-CONTENT" = "Como você tem um Patched USB Instalador, isto será super simples e indolor!\n1. Desligue seu Mac e, em seguida, ligue-o novamente na opção de retenção.\n2. Certifique-se de que o instalador USB esteja conectado, selecione o boot drive EFI roxo.\n3. Seu Mac será desligado imediatamente, então basta ligá-lo de volta e pronto!";

"PO-NV-TWO-TITLE" = "Restaurar valor (sem instalador)";
"PO-NV-TWO-CONTENT" = "Como você não tem um Patched USB Instalador, isto será um pouco mais difícil, mas não se preocupe, será fácil. Se você quiser, pode anotar isto, já que o Patched Sur não poderá ajudá-lo no caminho.\n1 Desligue seu Mac e, em seguida, ligue-o novamente segurando CMD-OPTION-R (mesmo que você tenha instalado a recuperação, você ainda precisa de recuperação pela Internet para isso).\n2. Conecte-se ao seu WiFi e depois deixe-o inicializar.\n3. Clique em Utilitários na barra de menu e, em seguida, clique em Terminal.\n4. Digite 'nvram boot-args=no_compat_check' e então pressione enter.\n5. Reinicialize seu Mac e então você estará pronto. ";

"PO-NV-BAR-TITLE" = "Problema da NVRAM";
"PO-NV-BAR-SUBTITLE" = "Vamos consertar isso.";

"PO-NV-NOUP-TITLE" = "Incapaz de atualizar sem o valor requerido da NVRAM";
"PO-NV-NOUP-CONTENT" = "A atualização do MacOS elimina o boot.plist patch, que é o que o Patched Sur usa para permitir que você inicialize seu Mac sem o -no_compat_check. Agora mesmo esse valor está faltando, então a atualização faria com que seu Mac não inicializasse mais. Uma vez restabelecido esse valor, você pode atualizar. Para fazer isso, clique no botão vermelho na parte inferior da janela.";
